export default {
  // 电话号码
  phone: /^1[3456789]\d{9}$/,
  // 金额保留小数点后2位
  money: /^\d+(\.\d{1,2})?$/,
  // 100万以内整数，不包含100万
  maxInteger: /^(([1-9]\d{0,5})|0)$/,
  // 10万以内不包含0的两位数小数字
  maxMoney: /^((([1-9]\d{0,4})(\.\d{1,2})?)|(0.\d{1,2})|99999.99)$/,
  // 100万以内不包含0的两位数小数字
  max100Money: /^((([1-9]\d{0,5})(\.\d{1,2})?)|(0.\d{1,2})|999999.99)$/,
  // 6-8位字符（至少包含数字跟字母，可以有字符）
  password: /(?=.*([a-zA-Z].*))(?=.*[0-9].*)[a-zA-Z0-9-*/+.~!@#$%^&*()]{6,8}$/,
  // 2～20个字符（汉字、数字、字母、下划线）
  name: /^[a-zA-Z\u4e00-\u9fa5][a-zA-Z0-9_\u4e00-\u9fa5]{1,19}$/,
  // url地址
  url: /^(https?|ftp|file):\/\/[-A-Za-z0-9+&@#/%?=~_|!:,.;]+[-A-Za-z0-9+&@#/%=~_|]$/
}
